app/controllers/roles_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def index
    @user = User.find(params[:user_id])