app/controllers/users_controller.rb

  def index
      @users = User.find(:all)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
    cookies.delete :auth_token
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`salt`, `last_name`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `first_name`, `password_reset_code`, `enabled`, `remember_token`, `login`, `email`, `created_at`) VALUES('314753e787cfe1c34d5af465dba9a2a942cd180a', 'Oglesby', '2009-09-23 02:29:51', NULL, 'aaf57846d1c0e10e27b1c8ea3e4e8db2de45b91a', NULL, 'ee97fdb67f4ce097298713aebec5655c963bef7b', 'Jason', NULL, 1, NULL, 'j0glesby', 'oglesby_jason@yahoo.com', '2009-09-23 02:29:51')